### Import necessary Libraries

In [1]:
import pandas as pd
import numpy as np

In [5]:
df = pd.read_csv(r"C:/Users/Rahul Verma/Desktop/Book1.csv") #Path to data
df.head(7)

,customer_shipping_city,customer_shipping_state,customer_shipping_zip,total_in_cents
0,Bristol,GLS,BS36 2UQ,81199
1,Bristol,GLS,BS36 2UQ,77164
2,Bristol,GLS,BS36 2UQ,75699
3,Bristol,GLS,BS36 2UQ,75699
4,Welwyn,HRT,AL6 9RG,75600
5,Bristol,GLS,BS36 2UQ,75600
6,Bristol,GLS,BS36 2UQ,74650

### Problem Statement : Add "total_in_cents" of every country and make a file which consist total cents earn from a city.

In [6]:
# print(List_Of_Categories_In_Column)
cols=list(df['customer_shipping_city'].value_counts().index)

In [9]:
len(cols)

4655

In [10]:
# dataframe to store values
temp = pd.DataFrame()

In [11]:
temp["cities"] = cols

In [24]:
for ind, col in enumerate(temp.cities):
    temp.loc[ind, "sum"] = df[df.customer_shipping_city == col]["total_in_cents"].sum()

In [51]:
df2 = df.drop_duplicates(subset="customer_shipping_city")

In [56]:
for ind, col in enumerate(temp.cities):
    temp.loc[ind, "shipping_state"] = df2[df2.customer_shipping_city == col]["customer_shipping_state"].values

In [57]:
for ind, col in enumerate(temp.cities):
    temp.loc[ind, "shipping_zip"] = df2[df2.customer_shipping_city == col]["customer_shipping_zip"].values

In [66]:
temp.head()

          cities       sum shipping_state shipping_zip
0      Southwold    9397.0            SFK     IP18 6WA
1  Littleborough   27793.0            LAN     OL15 0ET
2       Chigwell   36684.0            ESS      IG7 5BP
3    Bridlington  331625.0            ERY     YO16 6TA
4        Yateley  306222.0              H     GU46 6JX

In [69]:
temp.to_csv('filtered_data.csv' ,index = False)